#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-um3PDFxYgyU6Fqz3

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=1db5bdd3-1154-4c74-9659-73c5a40cdffd]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 0s [id=1db5bdd3-1154-4c74-9659-73c5a40cdffd]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.prometheus-stack: Refreshing state... [id=prometheus-stack]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.openarabic must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "openarabic" {
      - auto_upgrade   = false -> null
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2022-05-28 22:25:04 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://1db5bdd3-1154-4c74-9659-73c5a40cdffd.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "1db5bdd3-1154-4c74-9659-73c5a40cdffd" -> (known after apply)
      ~ ipv4_address   = "188.166.99.114" -> (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "openarabic"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
      - tags           = [] -> null
      ~ updated_at     = "2022-05-29 16:21:01 +0000 UTC" -> (known after apply)
      ~ urn            = "do:kubernetes:1db5bdd3-1154-4c74-9659-73c5a40cdffd" -> (known after apply)
      ~ vpc_uuid       = "569e4d1f-ab61-4813-a0c6-d5087581c3cb" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ maintenance_policy {
          ~ day        = "any" -> (known after apply)
          ~ duration   = "4h0m0s" -> (known after apply)
          ~ start_time = "17:00" -> (known after apply)
        }

      ~ node_pool {
          ~ actual_node_count = 3 -> (known after apply)
          ~ id                = "fec86f2d-8d48-4e65-92a3-ee08d7dd04d1" -> (known after apply)
          - labels            = {} -> null
          - max_nodes         = 0 -> null
          - min_nodes         = 0 -> null
            name              = "worker-pool"
          ~ node_count        = 3 -> 2
          ~ nodes             = [
              - {
                  - created_at = "2022-05-28 22:25:04 +0000 UTC"
                  - droplet_id = "301764430"
                  - id         = "09fb713c-b560-4a6f-b4e8-33429d8a847a"
                  - name       = "worker-pool-c66ur"
                  - status     = "running"
                  - updated_at = "2022-05-28 22:28:49 +0000 UTC"
                },
              - {
                  - created_at = "2022-05-28 22:25:04 +0000 UTC"
                  - droplet_id = "301764431"
                  - id         = "6729dee4-a1f8-4b3e-a2aa-1468be9be47a"
                  - name       = "worker-pool-c66ub"
                  - status     = "running"
                  - updated_at = "2022-05-28 22:28:49 +0000 UTC"
                },
              - {
                  - created_at = "2022-05-28 22:25:04 +0000 UTC"
                  - droplet_id = "301764432"
                  - id         = "ec3cffb7-9811-45c1-bae3-ae68e3dd7664"
                  - name       = "worker-pool-c66uw"
                  - status     = "running"
                  - updated_at = "2022-05-28 22:28:49 +0000 UTC"
                },
            ] -> (known after apply)
          ~ size              = "s-2vcpu-2gb" -> "s-2vcpu-4gb" # forces replacement
          - tags              = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.istio-istiod is tainted, so must be replaced
-/+ resource "helm_release" "istio-istiod" {
      ~ id                         = "istio-istiod" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "1.13.4"
              - chart       = "istiod"
              - name        = "istio-istiod"
              - namespace   = "istio-system"
              - revision    = 1
              - values      = "null"
              - version     = "1.13.4"
            },
        ] -> (known after apply)
        name                       = "istio-istiod"
      ~ status                     = "failed" -> "deployed"
        # (24 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*